{
  "conditions": [
    "“สัญญา” หมายถึง ข้อกำหนดและเงื่อนไขของสัญญาบริการ SellCoda App ตามที่ระบุในนี้ ซึ่งอาจเปลี่ยนแปลงได้เป็นครั้งคราว",
    "“บริษัท” หมายถึง  บริษัท ไอคอนเกษตร จำกัด",
    "“บริการของบริษัท” หมายถึง ผลิตภัณฑ์และบริการที่ได้ระบุไว้ที่นี้หรืออาจจัดหาให้โดยบริษัท และ/หรือบริษัทในเครือและบริษัทร่วมเป็นครั้งคราว",
    "“ผู้ใช้บริการ” หมายถึง บริษัทผู้ค้าผลิตภัณฑ์เคมีเกษตร และ/หรือ เจ้าของห้างร้านค้าเคมีเกษตร รวมทั้งเจ้าของร่วม, หุ้นส่วน และ/หรือลูกจ้าง",
    "“คู่ค้าของบริษัท” หมายถึง บริษัทผู้ผลิตสินค้าเคมีเกษตร และ/หรือ บริษัทผู้ค้าผลิตภัณฑ์เคมีเกษตร และ/หรือ เจ้าของห้างร้านค้าเคมีเกษตร ซึ่งอนุญาติให้บริษัท เป็นตัวแทนในการรับคำสั่งซื้อจากผู้ใช้บริการ",
    "“SellCoda App” หมายถึง บริการของบริษัทที่นำเสนอโดยบริษัท เพื่อเป็นตัวแทนจัดส่งคำสั่งซื้อของผู้ใช้บริการ ให้กับคู่ค้าของบริษัท ผ่านระบบอิเล็กทรอนิกส์ เพื่อเพิ่มความสะดวกรวดเร็วในการสื่อสารและการให้บริการหลังการขายระหว่างผู้ใช้บริการกับคู่ค้าของบริษัท ซึ่งจะนำพาซึ่งประสิทธิภาพและก่อประสิทธิผลในการให้บริการระหว่างกัน",
    "“รหัสประจำตัวผู้ใช้งาน SellCoda App” หมายถึง รหัสประจำตัวผู้ใช้บริการ (User Name) พร้อมรหัส OTP (One Time Password) ซึ่งจะส่งเข้าสู่มือถือของผู้ใช้บริการที่ลงทะเบียนไว้ เพื่อพิสูจน์รับรองและพิสูจน์ตัวตนก่อนอนุญาตให้ท่านเข้าใช้บริการ SellCoda App ได้",
    "“คำสั่ง” หมายถึง การขอ การสมัคร การอนุญาต หรือคำสั่งไม่ว่าในรูปแบบใดที่ผู้ใช้บริการหรือบุคคลอื่นที่อ้างว่าเป็นท่าน ไม่ว่าจะได้รับมอบอำนาจหรือไม่ก็ตาม ที่ได้ให้ไว้หรือส่งผ่านบริการ SellCoda App มายังบริษัท",
    "“เจ้าหน้าที่” หมายถึง เจ้าหน้าที่ พนักงาน หรือผู้ให้บริการของบริษัท"
  ],
  "stepData": [
    {
      "stepName": "ขั้นตอนการสมัครและการลงทะเบียนบริการ SellCoda App",
      "stepDetail": [
        "บริการ SellCoda App นี้เปิดให้ผู้ใช้บริการซึ่งเป็นลูกค้าของคู่ค้าของบริษัท เข้าใช้ SellCoda App โดยต้องเป็นไปตามข้อกำหนดและเงื่อนไขในนี้",
        "การสมัครขอใช้บริการ SellCoda App และการเข้าใช้นั้นต้องอยู่ในดุลยพินิจของบริษัทและคู่ค้าของบริษัท และบริษัทขอสงวนสิทธิที่จะรับหรือปฏิเสธการสมัคร ปฏิเสธการเข้าใช้บริการ SellCoda App ของท่าน หรือบริษัทอาจจำกัดการเข้าใช้หรือธุรกรรม หรือยกเลิกการเข้าใช้บริการ SellCoda App โดยไม่จำเป็นต้องให้เหตุผลการปฏิเสธหรือตอบรับคำขอข้อมูลของท่าน"
      ]
    },
    {
      "stepName": "การยอมรับข้อกำหนดและเงื่อนไข",
      "stepDetail": [
        "ท่านรับทราบว่าครั้งแรกที่ท่านสมัครเข้าใช้บริการ SellCoda App นั้น ให้ถือว่าท่านได้อ่าน เข้าใจ และตกลงที่จะปฏิบัติตามข้อกำหนดและเงื่อนไขของสัญญานี้ และท่านยังรับทราบและยอมรับความเสี่ยงที่เกี่ยวกับการทำธุรกรรมใดๆทางโทรศัพท์หรือสื่ออิเล็กทรอนิกส์อื่นๆ โดยบริษัท",
        "ท่านตกลงที่จะปฏิบัติตามข้อกำหนดและเงื่อนไขของสัญญานี้ในการเข้าและใช้บริการ SellCoda App ของบริษัท"
      ]
    },
    {
      "stepName": "ความรับผิดชอบสำหรับการเข้าใช้บริการ SellCoda App",
      "stepDetail": [
        "ท่านตกลงและรับทราบว่าท่านจะเก็บรหัส OTP ของผู้ใช้งานบริการ SellCoda App ไว้เป็นความลับและไม่ใช้ร่วมกับบุคคลอื่นหรือเปิดเผย ต่อบุคคลอื่นไม่ว่าด้วยเหตุผลใด รวมถึงเจ้าหน้าที่บริษัท",
        "ท่านตกลงว่าท่านจะรับผิดชอบการเข้าใช้และ/หรือการใช้บริการ SellCoda App ทั้งหมดที่กระทำผ่านรหัสOTP ที่ส่งเข้ามือถือผู้ใช้งานบริการ SellCoda App ของท่านตลอดเวลา ไม่ว่าจะเป็นการดำเนินการโดยท่านหรือบุคคลอื่นที่อ้างว่าเป็นท่าน",
        "โดยไม่คำนึงถึงเงื่อนไขต่างๆในนี้และเพื่อไม่ให้เกิดข้อสงสัย หากมีการใช้รหัส OTP ผู้ใช้งานบริการ SellCoda App ของท่านโดยไม่ได้รับอนุญาตซึ่งเกิดจากการกระทำของท่าน การทุจริต การเปิดเผย การใช้ในทางที่ผิดหรือโดยมิชอบ อย่างจงใจ ท่านต้องรับผิดชอบการใช้ดังกล่าวแม้ว่าจะได้ทำการแจ้งไว้ตามข้างต้นแล้วก็ตาม"
      ]
    },
    {
      "stepName": "คำสั่งและการอนุญาต",
      "stepDetail": [
        "ท่านต้องรับผิดชอบคำสั่งทั้งหมดที่ส่งมายัง SellCoda App โดยผ่านรหัส OTP ผู้ใช้งานบริการ SellCoda App ของท่านตลอดเวลาไม่ว่าคำสั่งเหล่านั้นจะถูกทำขึ้นโดยท่านหรือคนอื่นที่อ้างว่าเป็นท่าน และท่านได้ตกลงและยอมรับว่าบริษัทมีสิทธิที่จะใช้และปฏิบัติตามคำสั่งที่ได้ทำหรือส่งตามการใช้และการเข้ารหัสประจำตัวผู้ใช้งานบริการ SellCoda App ที่ท่านได้ทำหรือส่ง และด้วยเหตุนี้บริษัทจะไม่รับผิดชอบหรือรับผิดในความสูญเสียใดๆที่ท่านอาจได้รับ ไม่ว่าโดยทางตรงหรือทางอ้อมอันเกิดจากคำสั่งดังกล่าว",
        "คำสั่งทั้งหมดที่ส่งมายังและ/หรือรับโดยบริษัทผ่านรหัสประจำตัวผู้ใช้งานบริการ SellCoda App ของท่านจะถือเป็นคำสั่งตามปกติและจริงแท้ที่ท่านทำขึ้น    เพื่อไม่ให้เกิดข้อสงสัย บริษัทไม่จำเป็นต้องพิสูจน์รับรองคำสั่งดังกล่าวกับท่านเพื่อระบุความถูกต้อง แต่บริษัทอาจใช้สิทธิและวิจารณญาณดำเนินการพิสูจน์รับรองเพื่อวัตถุประสงค์ของบริษัทเอง",
        "คำสั่งทั้งหมดที่ส่งผ่านรหัส OTP ประจำตัวผู้ใช้งานบริการ SellCoda App อยู่ในความรับผิดชอบของท่าน หากท่านประสงค์จะแก้ไข เปลี่ยนแปลง ต้องดำเนินการแจ้งที่ คู่ค้าของบริษัท",
        "ท่านอนุญาตให้บริษัทรับและปฏิบัติตามคำสั่งที่ท่านได้ทำขึ้นที่เกี่ยวกับบริการ SellCoda App ที่ท่านทำขึ้นผ่านรหัส OTP ผู้ใช้งานบริการ SellCoda App ของท่าน ไม่ว่าคำสั่งนั้นจะทำขึ้นโดยท่านเองหรือบุคคลอื่นที่อ้างเป็นท่าน",
        "หากท่านพบหรือมีเหตุผลที่เชื่อได้ว่าคำสั่งที่ส่งให้หรือรับโดยบริษัท ไม่ถูกต้องหรือไม่สมบูรณ์ ท่านจะแจ้งให้บริษัททราบทางโทรศัพท์ และเพื่อไม่ให้เกิดข้อสงสัย ทุกสายโทรศัพท์ที่โทรเข้ามายังบริษัท จะถูกบันทึกไว้โดยบริษัท",
        "บริษัทจะต้องไม่ถูกบังคับให้ทำหน้าที่ขอยกเลิก เพิกถอน แก้กลับหรือแก้ไขคำสั่งใดๆ สำหรับใช้บริการ SellCoda App หรือคำสั่งอื่นๆ หลังจากที่บริษัทได้รับคำสั่งจากท่านแล้ว อย่างไรก็ตามบริษัทอาจยกเลิก เพิกถอน แก้กลับ หรือแก้ไขคำสั่งก่อนหน้านี้ หากคำขอยกเลิก เพิกถอน แก้กลับ หรือแก้ไขนั้นได้รับและมีผลบังคับใช้ก่อนดำเนินการตามคำสั่งนี้ก่อนหน้านี้",
        "ในกรณีที่บริษัทตัดสินใจที่จะปฏิบัติตามและ/หรือดำเนินการตามคำสั่งหรือจำเป็นต้องปฏิบัติตามและ/หรือดำเนินการตามคำสั่ง บริษัทจะมีเวลาในการปฏิบัติตามและดำเนินการตามคำสั่งตามสมควรโดยคำนึงถึงระบบ และการปฏิบัติการของบริษัทและสถานการณ์อื่นๆที่เกิดขึ้นในขณะนั้น และด้วยเหตุนี้บริษัทจะไม่รับผิดชอบหรือไม่รับผิดสำหรับความสูญเสียที่เกิดขึ้นจากความล่าช้าในส่วนของบริษัทในการปฏิบัติตามและ/หรือดำเนินการตามคำสั่งดังกล่าว",
        "กรณีที่คำสั่งคลุมเครือและ/หรือไม่สอดคล้องกับคำสั่งอื่น บริษัท มีสิทธิที่จะใช้และปฏิบัติตามคำสั่งนี้ตามการตีความอย่างสมเหตุสมผล ซึ่งเจ้าหน้าที่เชื่อโดยสุจริตว่าเป็นการตีความที่ถูกต้อง หรือปฏิเสธที่จะปฏิบัติตามคำสั่งจนกว่าบริษัท จะได้รับคำสั่งใหม่ในรูปแบบและลักษณะตามที่บริษัทกำหนด"
      ]
    },
    {
      "stepName": "บริการ SellCoda App",
      "stepDetail": [
        "บริษัทให้บริการดังต่อไปนี้แก่ท่าน โดยต้องเป็นไปตามข้อกำหนดและเงื่อนไขของสัญญานี้และข้อกำหนดและเงื่อนไขอื่นๆที่อาจเกี่ยวข้องกับบริการของบริษัทหนึ่งๆ และท่านต้องเป็นคู่ค้าที่ลงทะเบียนกับ คู่ค้าของบริษัท ที่ทำผ่านบริการ SellCoda App ไว้"
      ],
      "nestedStepDetail": [
        "การเข้าถึงข้อมูลสินค้าและบริการของคู่ค้าของบริษัท",
        "ข่าวสารและสิทธิประโยชน์ต่างๆ เพื่อลูกค้าของบริษัท และคู่ค้าของบริษัท",
        "ช่องทางการติดต่อสื่อสารที่พร้อมให้บริการ ตลอด 24 ชั่วโมง",
        "การเข้าถึงข้อมูลสถานะคำสั่งซื้อระหว่างผู้ใช้บริการกับคู่ค้าของบริษัท",
        "บริการของบริษัทแบบใหม่อื่นๆที่นำเสนอโดยบริษัท หรือบริษัทในเครือ บริษัทร่วม หรือบุคคลภายนอกเป็นครั้งคราว ด้วยการใช้บริการทางบริษัทแบบใหม่ที่นำเสนอนี้ ท่านตกลงที่จะมีผลผูกพันทางสัญญาที่เกี่ยวกับบริการของบริษัทแบบใหม่นี้เท่าที่สัญญาจะมีผลใช้บังคับ"
      ]
    }
  ],
  "contact": {
    "title": "ช่องทางติดต่อ",
    "content": "หากผู้ใช้บริการ มีคำถามเกี่ยวกับข้อกำหนดหลักเกี่ยวกับการบริการ หรือปัญหาเกี่ยวกับการใช้แอปพลิเคชัน กรุณาติดต่อบริษัทฯ ตามที่อยู่อีเมล sellcoda@iconkaset.com"
  }
}
